/* Window body when Phone already registered as a Bluetooth phone. [%@ = phone name] */
"%@ is already registered as a Bluetooth phone." = "%@ on jo rekisteröity Bluetooth-puhelimeksi.";

/* Window body when Phone already registered as a USB phone. [%@ = phone name] */
"%@ is already registered as a USB device." = "%@ on jo rekisteröity USB-laitteeksi.";

/* Window title when detecting some USB devices failed */
"Failed to identify some USB devices" = "Joidenkin USB-laitteiden tunnistaminen epäonnistui";

/* Button to go to Website for KB */
"Go to Website" = "Siirry verkkosivulle";

/* Alert Title: Conflict with builtin plugin
   Alert Title: Conflict with 2 plugins */
"iSync can't open because of a problem with a plug-in." = "iSync ei käynnisty koska jonkin pluginin kanssa on ongelma.";

/* Message displayed when USB scan failed for some USB devices. %@ is the error description */
"iSync was unable to identify some USB devices:\n%@" = "iSync ei tunnistanut joitakin USB-laitteita:\n%@";

/* OK Button */
"OK" = "OK";

/* Window title when Phone already registered */
"Phone already registered" = "Puhelin on jo rekisteröity";

/* Intro text: Alert Title: Conflict with builtin plugin */
"The following plug-in doesn't work with this version of iSync. Click the arrow to show the plug-in, move or delete it, and then open iSync again." = "Seuraava plugin ei toimi tämän iSync-version kanssa. Tuo plugin näkyviin osoittamalla nuolta ja poista tai siirrä se, ja avaa sitten iSync uudelleen.";

/* Intro text: Alert Title: Conflict with 2 plugins */
"There is a problem with one of the plug-ins. Click the arrow to show the plug-ins, move or delete one of them, and then open iSync again." = "Jonkin pluginin kanssa on ongelma. Tuo pluginit näkyviin osoittamalla nuolta, siirrä tai poista jokin niistä ja avaa iSync uudelleen.";

/* Alert Body when Phone Firmware is too old and we don't have a KB */
"To enable this phone to work with iSync, contact the phone\\U2019s manufacturer or your service provider to update the firmware on your phone." = "Jos haluat puhelimen toimivan iSyncin kanssa, pyydä puhelimen valmistajaa tai palveluntarjoajaa päivittämään puhelimen firmware.";

/* Alert Body when Phone Firmware is too old and we have a KB */
"To enable this phone to work with iSync, contact the phone\\U2019s manufacturer or your service provider to update the firmware on your phone. For more information, visit the iSync Support website." = "Jos haluat puhelimen toimivan iSyncin kanssa, pyydä puhelimen valmistajaa tai palveluntarjoajaa päivittämään puhelimen firmware. Lisätietoja saat iSyncin tukisivuilta.";

/* Window title when Phone Firmware is too old */
"Your phone, \\U201C%@\\U201D does not work with this version of iSync." = "Puhelin ”%@” ei toimi tämän iSync-version kanssa.";

